app/controllers/api/v1/ingredients_controller.rb

SELECT "ingredients".* FROM "ingredients"
---
  def index
    render json: Ingredient.all